docs/_static/data-model/o-ran-smo-teiv-rel-physical-ran-rel.dot
digraph "moduleName" {
node ["shape"="box","fontname"="Arial"]
edge ["color"="darkslategray4","fontname"="Arial"]
"o-ran-smo-teiv-physicalPhysicalAppliance" ["label"="PhysicalAppliance","style"="filled","fillcolor"="#074EE241"]
"o-ran-smo-teiv-ranNearRTRICFunction" ["label"="NearRTRICFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranOCUCPFunction" ["label"="OCUCPFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranOCUUPFunction" ["label"="OCUUPFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranODUFunction" ["label"="ODUFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-physicalPhysicalAppliance" -> "o-ran-smo-teiv-ranODUFunction" ["label"="SERVES","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-physicalPhysicalAppliance" -> "o-ran-smo-teiv-ranOCUUPFunction" ["label"="SERVES","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-physicalPhysicalAppliance" -> "o-ran-smo-teiv-ranOCUCPFunction" ["label"="SERVES","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-physicalPhysicalAppliance" -> "o-ran-smo-teiv-ranNearRTRICFunction" ["label"="SERVES","headlabel"="0..*","taillabel"="0..*","arrowhead"="vee"]
}
